out/CVE-2025-2746/probe-input.json

{
  "requests": [
    {
      "method": "POST",
      "uri": "/CMSPages/Staging/SyncServer.asmx",
      "headers": {
        "Accept": "*/*",
        "Content-Type": "text/xml; charset=utf-8",
        "SOAPAction": "http://localhost/SyncWebService/SyncServer/ProcessSynchronizationTaskData"
      },
      "body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n    <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n        <soap:Header>\n            <wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\" xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\">\n                <wsse:UsernameToken>\n                    <wsse:Username>admin</wsse:Username>\n                </wsse:UsernameToken>\n            </wsse:Security>\n        </soap:Header>\n        <soap:Body>\n            <ProcessSynchronizationTaskData xmlns=\"http://localhost/SyncWebService/SyncServer\">\n                <stagingTaskData><![CDATA[<test123abc>]]></stagingTaskData>\n            </ProcessSynchronizationTaskData>\n        </soap:Body>\n    </soap:Envelope>"
    }
  ],
  "paranoia": 2
}
